export const products = [
	{
		id: "real_power",
		name: { en: "Real Power", mr: "रिअल पॉवर ", hi: "रिअल पॉवर " },
		usage: {
			en: "Real Power helps in increasing the size and weight of flowers, fruits, and pods.",
			mr: " रिअल पॉवर हे फुले, फळे,शेंगांचा आकार व वजन वाढवायला मदत करते.",
			hi: "रिअल पॉवर फूलों, फलों, और फली के आकार और वजन को बढ़ाने में मदद करता है।",
		},
		Quantity: "1000 ML / 500 ML",
		price: "₹ 850",
		MRP: "₹ 998",
		image: "/product new images/real_power.png",
		about: {
			en: `
        
              <strong>🌿 Features</strong>:<br />
              1) Increases the number of white roots.<br />
              2) Helps in growth, branching, and darkening.<br />
              3) Enhances disease resistance.<br />
              4) Aids in increased flowering.<br />
              5) Real Power helps in increasing the size and weight of flowers, fruits, and pods.<br />
              <br/>
              <strong> 🌿Dosage</strong>:<br />
              Spraying: 2 ml per liter <br />
              Through drip: 2 liters per acre <br /><br/>
			  <strong>⚠️ Precautions:</strong><br/>
1. Do not exceed the recommended dose.<br/>
2. Shake well before use and prepare a fresh solution.<br/>
3. Keep away from children, animals, and direct sunlight.
        `,
			mr: `
       
           <strong>🌿 वैशिष्ट्य: </strong><br />
            1) पांढऱ्या मुळींची संख्या वाढवते. <br />
            २) वाढ, फुटवा आणि काळोखी करायला मदत करते  <br />
            3) रोग प्रतिकार क्षमता वाढवते  <br />
            4) फुलधारणा जास्त करायला मदत करते  <br />
            5) रिअल पॉवर हे फुले, फळे,शेंगांचा आकार व वजन वाढवायला मदत करते. <br /><br/>
            <strong>🌿 प्रमाण : </strong> <br />
            फवारणी 2 मिली प्रति लिटर  <br />
            ड्रिपद्वारे 2 लिटर प्रति एक<br/><br/>
			<strong>⚠️ सावधगिरी:</strong><br/>
1. शिफारस केलेल्या मात्रेपेक्षा जास्त वापर करू नका.<br/>
2. वापरण्यापूर्वी चांगले हलवा आणि ताजे द्रावण तयार करा.<br/>
3. लहान मुले, प्राणी व थेट सूर्यप्रकाशापासून दूर ठेवा.
        `,
			hi: `
        
             🌿  <strong>विशेषताएं:</strong><br />
            1) सफेद जड़ों की संख्या बढ़ाता है।<br />
            2) वृद्धि, शाखाओं और कालेपन में मदद करता है।<br />
            3) रोग प्रतिरोधक क्षमता बढ़ाता है।<br />
            4) फूलों की संख्या बढ़ाने में मदद करता है।<br />
            5) रिअल पॉवर फूलों, फलों, और फली के आकार और वजन को बढ़ाने में मदद करता है।<br /><br/>
             <strong>🌿  मात्रा:</strong><br />
              स्प्रे करने के लिए: 2 मिली प्रति लीटर<br />
              ड्रिप के माध्यम से: 2 लीटर प्रति एकड़<br/></br/>
			  <strong>⚠️ सावधानियाँ:</strong><br/>
1. अनुशंसित मात्रा से अधिक उपयोग न करें।<br/>
2. उपयोग से पहले अच्छी तरह हिलाएं और ताजा घोल बनाएं।<br/>
3. बच्चों, जानवरों और सीधे धूप से दूर रखें।<br/>
        `,
		},
		ratings: {
			average: "★ ★ ★ ★ ☆",
			count: "(1,995 ratings)",
		},
	},
	{
		id: "sticker",
		name: { en: "A Stick", mr: "ए स्टिक ", hi: "ए स्टिक " },
		usage: {
			en: "Adhesive fertilizer that improves nutrient absorption.",
			mr: "संपीटनक  ज्यामध्ये पोषण सोडविण्यासाठी सुधारले जाते.",
			hi: "पोषक अवशोषण में सुधार करने वाला चिपचिपा ।",
		},
		Quantity: "500 ML",
		price: "₹ 240",
		MRP: "₹ 260",
		image: "/product new images/astick1.png",
		about: {
			en: `
          Sticky Fertilizer enhances nutrient absorption in plants, resulting in healthier growth.</br>
          is a high-quality adhesive fertilizer designed to significantly improve nutrient absorption in plants. It ensures that essential nutrients are effectively delivered to the plant roots, promoting healthier and more robust growth.
        `,
			mr: `
          स्टिकी  रोगांची नियंत्रण करणारी, तज्ज्ञ संसाधनांच्या संग्रहाचे वापर करते.</br>
          स्टिकी  म्हणजे पोषण सोडविण्यासाठी अत्यंत उच्च-गुणवत्तेचे संपीटनक  आहे. हे महत्वाचे पोषक तत्त्वे वनस्पतींच्या मुळांपर्यंत प्रभावीपणे पोहोचवते, ज्यामुळे आरोग्यदायी आणि अधिक मजबूत वाढ होण्यास मदत होते.
        `,
			hi: `
          चिपचिपा  पौधों में पोषक अवशोषण में सुधार करता है, जिससे उनकी स्वस्थ वृद्धि होती है।</br>
          चिपचिपा  एक उच्च गुणवत्ता वाला चिपकने वाला  है, जिसे पौधों में पोषक तत्वों के अवशोषण को काफी हद तक सुधारने के लिए डिजाइन किया गया है। यह सुनिश्चित करता है कि आवश्यक पोषक तत्व प्रभावी ढंग से पौधों की जड़ों तक पहुंचें, जिससे स्वस्थ और अधिक मजबूत वृद्धि को बढ़ावा मिलता है।
        `,
		},
		ratings: {
			average: "★ ★ ★ ★ ☆",
			count: "(1,700 ratings)",
		},
	},
	{
		id: "quality",
		name: { en: "Quality", mr: "क्वालिटी ", hi: "क्वालिटी " },
		usage: {
			en: "Revolutionary fertilizer with advanced growth formulas.",
			mr: "प्रगत विकास सूत्रांसह क्रांतिकारी .",
			hi: "उन्नत विकास सूत्रों वाला क्रांतिकारी ।",
		},
		Quantity: "1000 ML",
		price: "₹ 850",
		MRP: "₹ 1150",
		image: "/product new images/quality1.png",
		about: {
			en: `
         <strong>🌿 Quality Benefits:</strong><br/>
1. Quality is a herbal product.<br/>
2. When sprayed on plants, it helps in better absorption of potassium from the soil.<br/>
3. It increases the flexibility and turgidity of the roots.<br/>
4. Due to its quality, it helps in enhancing the ion exchange capacity of roots.<br/>
5. Nutrients like K, Mg, Zn, Fe are easily absorbed through the roots.<br/>
6. It helps improve fruit quality by enhancing color, size, taste, and sugar content.<br/><br/>
<strong>🌿Dosage:</strong><br/>

1. Spraying: 1.5 to 2 ml per liter of water<br/>
2. Through Drip: 1 liter per acre<br/><br/>
<strong>⚠️ Precautions:</strong><br/>
1. Shake well before use.<br/>
2. Do not exceed the recommended dosage.<br/>
3. Keep out of reach of children and animals.
        `,
			mr: `
         <strong>🌿 फायदे :</strong><br/>
1. क्वालिटी हे एक हर्बल उत्पादन आहे.<br/>
2. जेव्हा वनस्पतीवर फवारणी केली जाते तेव्हा जमिनीतून पोटॅशियमचे शोषण वाढवण्यासाठी मदत करते.<br/> 3.
मुळ्यांची लवचिकता व टर्जिडिटी (ताजेपणा) वाढवते.<br/>4. 
गुणवत्तेमुळे मुळ्यांच्या आयन एक्सचेंज क्षमतेत वाढ होते.<br/> 5. 
K, Mg, Zn, Fe सारखी अन्नद्रव्ये मुळांद्वारे सहज शोषली जातात.<br/> 6. 
हे फळांचा दर्जा राखत रंग, आकार, चव व साखर वाढवण्यास मदत करते.<br/><br/>
<strong>🌿 प्रमाण:</strong><br/>

1. फवारणी: 1.5 ते 2 मिली प्रति लिटर पाणी<br/>
2. ड्रिपद्वारे: 1 लिटर प्रति एकर<br/><br/>
<strong>⚠️ सावधगिरी:</strong><br/>
1. वापरण्यापूर्वी चांगले हलवा.<br/>
2. शिफारसीपेक्षा जास्त मात्रा वापरू नका.<br/>
3. लहान मुले आणि प्राण्यांपासून दूर ठेवा.
        `,
			hi: `
         <strong>🌿   फायदे :</strong><br/>
1. क्वालिटी एक हर्बल उत्पाद है।<br/> 2. 
जब इसे पौधों पर छिड़का जाता है, तो यह मिट्टी से पोटेशियम के अवशोषण में मदद करता है।<br/> 3. 
यह जड़ों की लचीलापन और टर्जिडिटी (ताजगी) को बढ़ाता है।<br/> 4. 
इसकी गुणवत्ता के कारण यह जड़ों की आयन विनिमय क्षमता को बढ़ाने में सहायक होता है।<br/> 5. 
K, Mg, Zn, Fe जैसे पोषक तत्व जड़ों के माध्यम से आसानी से अवशोषित होते हैं।<br/> 6. 
यह फलों की गुणवत्ता बनाए रखता है तथा रंग, आकार, स्वाद और शक्कर की मात्रा को बढ़ाने में सहायक होता है।<br/><br/>
<strong>🌿 मात्रा:</strong><br/>

1. फवारनी: 1.5 से 2 मिली प्रति लीटर पानी <br/> 2. 
ड्रिप द्वारा: 1 लीटर प्रति एकड़<br/><br/>
<strong>⚠️ सावधानियाँ:</strong><br/>
1. उपयोग से पहले अच्छी तरह हिलाएं।<br/>
2. अनुशंसित मात्रा से अधिक उपयोग न करें।<br/>
3. बच्चों और जानवरों की पहुंच से दूर रखें।
        `,
		},
		ratings: {
			average: "★ ★ ★ ★ ★",
			count: "(2,500 ratings)",
		},
	},
	{
		id: "sugarcane_special",
		name: { en: "Sugarcane Special", mr: "ऊस स्पेशल ", hi: "ऊस स्पेशल " },
		price: "₹ 900",
		MRP: "₹ 1200",
		image: "/product new images/sugarcane_special`.png",
		usage: {
			en: "Ideal for improving soil health and enhancing nutrient absorption.",
			mr: "माटीचे आरोग्य सुधारण्यासाठी आणि पोषक अवशोषण सुधारण्यासाठी उपयुक्त.",
			hi: "मृदा स्वास्थ्य में सुधार करने और पोषक अवशोषण को बढ़ाने के लिए आदर्श है।",
		},
		Quantity: "1000 ml",
		about: {
			en: `
         <strong>🌿 Benefits of Sugarcane Special:</strong><br/><br/>
           1) Increase in the length and thickness of sugarcane setts<br/>

2) Increase in the depth (dark region) of the sugarcane<br/>

3) Increase in the number of white roots<br/>

4) Increase in the number of tillers (shoots)<br/>

5) Increase in the length and width of leaves<br/>

6) Enhancement in the photosynthesis process in sugarcane<br/>
        `,
			mr: `
      <strong>🌿 ऊस स्पेशलचे फायदे:</strong>
<br/><br/>

1)ऊसाच्या पेऱ्यांची लांबी व जाडीमध्ये वाढ<br/>

2) ऊसाच्या काळोखी भागामध्ये वाढ<br/>

3) पांढऱ्या मुळांच्या संख्येत वाढ<br/>

4) फुटव्यांच्या संख्येत वाढ<br/>

5) पानांची लांबी व रुंदीमध्ये वाढ<br/>

6) ऊसामधील प्रकाशसंश्लेषण प्रक्रियेमध्ये वाढ<br/>
  
        `,
			hi: `
        <storng>🌿 गन्ना स्पेशल के लाभ:</strong>
<br/><br/>

1) गन्ने के टुकड़ों की लंबाई और मोटाई में वृद्धि<br />

2) गन्ने के गहरे (काले) हिस्से में वृद्धि<br />

3) सफेद जड़ों की संख्या में वृद्धि<br />

4) फुटावों (अंकुरों) की संख्या में वृद्धि<br />


5) पत्तियों की लंबाई और चौड़ाई में वृद्धि<br />


6) गन्ने में प्रकाश संश्लेषण की प्रक्रिया में वृद्धि<br />

              `,
		},
		ratings: {
			average: "★ ★ ★ ★ ☆",
			count: "(1,200 ratings)",
		},
	},
	{
		id: "onion_special",
		name: {
			en: "Onion Special ",
			mr: "कांदा स्पेशल",
			hi: "कांदा स्पेशल",
		},
		price: "₹ 850 ",
		usage:{
en:"Enhances crop yield, oil content, and root growth while improving soil health, moisture retention, and reducing fertilizer use.",
mr:"पीक उत्पादन, तेलाचे प्रमाण आणि मुळे वाढवतो, तसेच मातीची गुणवत्ता, ओलावा टिकवण्याची क्षमता सुधारतो आणि खतांची गरज कमी करतो.",
hi:"फसल की उपज, तेल की मात्रा और जड़ों की वृद्धि को बढ़ाता है, साथ ही मिट्टी की गुणवत्ता, नमी बनाए रखने की क्षमता और खाद की आवश्यकता को कम करता है।"
		},
		MRP: "₹ 1155",
		image: "/product new images/onion_special1.png",
		Quantity: "1000 ml",
		about: {
			en: `
        <strong>🌿 Benefits of Onion Special:</strong><br/>
         1. Increases crop yield by 25-30%.<br/>
2. Increases oil percentage in the crop and protects against drying.<br/>
3. Helps in rapid development of fibrous roots.<br/>
4. Increases quality, weight and shine of the crop.<br/>
5. Improves soil health and maintains pH.<br/>
6. Soil moisture level.<br/>
7. Improves absorption of micronutrients from the soil.<br/>
8. Reduces use of chemical fertilizers by 15 to 20%.<br/><br/>
<strong>🌿Doses </strong><br/>
 Spray 2 -3 Ml Per Litre<br/>
             Drenching 1 Litre Per Acre<br/><br/>

             <strong>⚠️ Cautions/Precautions</strong><br/>
             1. Do not overdose.<br/>
             2. Keep out of reach of children.<br/>
             3. Shake well before use.

    
        `,
			mr: `
          1) पिकाचे उत्पादन 25-30% पर्यंत वाढवते.<br/>
2) पिकातील तेलाचे प्रमाण वाढवते आणि वाळण्यापासून संरक्षण करते.<br/>
3) रेशमदार मुळांच्या जलद वाढीस मदत करते.<br/>
4) पिकाची गुणवत्ता, वजन आणि चमक वाढवते.<br/>
5) मातीचे आरोग्य सुधारते आणि pH संतुलित ठेवते.<br/>
6) मातीतील आर्द्रतेची पातळी टिकवून ठेवते.<br/>
7) मातीमधून सूक्ष्म अन्नद्रव्यांचे शोषण सुधारते.<br/>
8) रासायनिक खतांचा वापर 15 ते 20% पर्यंत कमी करते.<br/><br/>

<strong>🌿 डोस:</strong><br/>
फवारणी – प्रती लिटर पाण्यात 2-3 मिली<br/>
ड्रेंचिंग – प्रती एकर 1 लिटर<br/><br/>
<strong>⚠️ सूचना</strong><br/>
1. जास्त प्रमाणात वापर करू नका.<br/>
2. मुलांच्या आवाक्याबाहेर ठेवा.<br/>
3. वापरण्यापूर्वी चांगले हलवा.


        `,
			hi: `
        1) फसल की उपज 25-30% तक बढ़ाता है।<br/>
2) फसल में तेल की मात्रा बढ़ाता है और सूखने से बचाता है।<br/>
3) रेशेदार जड़ों के तेजी से विकास में मदद करता है।<br/>
4) फसल की गुणवत्ता, वजन और चमक को बढ़ाता है।<br/>
5) मिट्टी की सेहत सुधारता है और pH को संतुलित रखता है।<br/>
6) मिट्टी में नमी के स्तर को बनाए रखता है।<br/>
7) मिट्टी से सूक्ष्म पोषक तत्वों के अवशोषण में सुधार करता है।<br/>
8) रासायनिक उर्वरकों के उपयोग को 15 से 20% तक कम करता है।<br/><br/>

<strong>🌿 खुराक:</strong><br/>
स्प्रे – प्रति लीटर पानी में 2-3 मिलीलीटर<br/>
ड्रेंचिंग – प्रति एकड़ 1 लीटर<br/><br/>
<strong>⚠️ सूचना</strong><br/>
1. अधिक मात्रा में उपयोग न करें।<br/>
2. बच्चों की पहुंच से दूर रखें।<br/>
3. उपयोग से पहले अच्छी तरह हिलाएं।
          `,
		},
		ratings: {
			average: "★ ★ ★ ★ ☆",
			count: "(1,200 ratings)",
		},
	},
	{
		id: "humi_acid",
		name: {
			en: "Humic Acid ",
			mr: "हह्यूमिक ऍसिड ",
			hi: "हह्यूमिक ऍसिड ",
		},
		usage:{
			en:"A-Rich Humic 98% promotes strong root growth, improves nutrient uptake, and enhances soil fertility. It boosts crop quality, yield, and helps plants withstand climate stress.",
			mr:"ए-रिच ह्युमिक 98% मुळांची वाढ, पोषकद्रव्य शोषण आणि मातीची सुपीकता वाढवतो. पिकाची गुणवत्ता, उत्पादन आणि हवामानातील तणाव सहन करण्याची क्षमता सुधारतो.",
			hi:"ए-रिच ह्युमिक 98% जड़ों की वृद्धि, पोषक तत्वों का अवशोषण और मिट्टी की उर्वरता बढ़ाता है। यह फसल की गुणवत्ता, उपज और मौसम संबंधी तनाव से बचाव करता है।"

		},
		price: "₹ 480 ",
		MRP: "₹ 980",
		image: "/product new images/_DSC2878 (1).png",
		Quantity: "1000 gm",
		about: {
			en: `
        <strong>🌿 Benefits of Humic Acid:</strong><br/>
         1. A-Rich Humic 98% promotes the growth of primary, secondary, and tertiary (feeding/white) roots, which enhances the uptake of nutrients and water in crops.
<br/>
2. It improves soil fertility and increases the water-holding capacity of the soil.<br/>
3. It boosts white root growth, enhancing the absorption of micronutrients from the soil, thus improving flowering and fruit setting in plants.<br/>
4. It helps plants to cope with biological stress like excess heat, heavy rainfall, and extreme cold.<br/>
5. It improves crop quality and leads to increased yield.<br/><br/>
<strong>🌿Doses </strong><br/>
 A-Rich Humic: 1 kg per acre<br/><br/>

             <strong>⚠️ Cautions/Precautions</strong><br/>
             1. Store in a cool, dry place away from direct sunlight.<br/>
2. Do not mix with strong acidic or alkaline substances.<br/>
3. Keep away from children and animals.

    
        `,
			mr: `
      <strong>🌿 फायदे: </strong><br/>
          1. ए रिच ह्युमिक ९८% हे पिकांमध्ये मुख्य मुळे, दुय्यम मुळे आणि तृतीय मुळे (टर्शरी रूट्स / फिडिंग रूट / व्हाईट रूट) यांच्या वाढीस मदत करते, ज्यामुळे अन्नद्रव्ये आणि पाण्याचा पुरवठा सुधारतो.<br/> 2. 
मातीची सुपिकता वाढवते व पाणी धरून ठेवण्याची क्षमता वाढते.<br/> 3. 
पांढऱ्या मुळ्यांची वाढ होऊन सूक्ष्म अन्नद्रव्यांचे शोषण वाढते, त्यामुळे फुलधारणा व फलधारणा सुधारते.<br/> 4. 
जैविक ताण (उष्णता, अतिपाऊस, अती थंडी) सहन करण्यास मदत होते.<br/> 5.
पिकाचा दर्जा वाढवतो व उत्पादनात वाढ होते.<br/><br/>

<strong>🌿 डोस:</strong><br/>
ए रिच ह्युमिक: १ किलो प्रति एकर<br/><br/>
<strong>⚠️ सावधगिरी:</strong><br/>
1. थेट सूर्यप्रकाशापासून दूर, थंड व कोरड्या ठिकाणी साठवा.<br/>
2. तीव्र आम्ल किंवा क्षारीय पदार्थांसोबत मिसळू नका.<br/>
3. लहान मुले आणि प्राण्यांपासून दूर ठेवा.


        `,
			hi: `
       <strong>🌿 फायदे: </strong><br/>
       1. ए रिच ह्युमिक ९८% मुख्य, द्वितीयक और तृतीयक (फीडिंग/व्हाइट) जड़ों की वृद्धि को बढ़ाता है, जिससे पौधों को पोषक तत्वों और पानी की आपूर्ति बेहतर होती है।<br/> 2. 
मिट्टी की उर्वरता और जलधारण क्षमता बढ़ती है।<br/> 3. 
सफेद जड़ों की वृद्धि से सूक्ष्म पोषक तत्वों का अवशोषण बढ़ता है, जिससे फूल और फल लगने की प्रक्रिया में सुधार होता है।<br/> 4. 
यह जैविक तनाव (अधिक गर्मी, अधिक वर्षा और ठंड) से पौधों की रक्षा करता है।<br/> 5. 
फसल की गुणवत्ता में सुधार होता है और उपज में वृद्धि होती है।<br/><br/>

<strong>🌿 खुराक:</strong><br/>
ए रिच ह्युमिक: 1 किलो प्रति एकड़<br/><br/>
<strong>⚠️ सावधानियाँ:</strong><br/>
1. इसे ठंडी और सूखी जगह पर स्टोर करें, सीधे धूप से दूर रखें।<br/>
2. तेज अम्ल या क्षारीय पदार्थों के साथ मिलाने से बचें।<br/>
3. बच्चों और जानवरों की पहुँच से दूर रखें।<br/>
          `,
		},
		ratings: {
			average: "★ ★ ★ ★ ☆",
			count: "(1,200 ratings)",
		},
	},
	{
		id: "agro_fert",
		name: {
			en: "Agrofert",
			mr: "ऍग्रो फर्ट ",
			hi: "ऍग्रो फर्ट",
		},
		usage:{
			en:"Agro Fert is a micronutrient blend that boosts yield, improves fruit quality, and reduces pest damage.",
			mr:"अ‍ॅग्रो फर्ट हे सूक्ष्म अन्नद्रव्यांचे मिश्रण असून उत्पादन वाढवते, फळांची गुणवत्ता सुधारते आणि कीटकांची बाधा कमी करते.",
			hi:"एग्रो फर्ट एक सूक्ष्म पोषक तत्वों का मिश्रण है जो उपज बढ़ाता है, गुणवत्ता सुधारता है और कीटों से बचाता है।"
		},
		price: "₹ 560",
		MRP: "₹ 950",
		image: "/product new images/agrofert1.png",
		Quantity: "1000 ml",
		about: {
			en: `
         <strong>🌿 Uses of AgroFert: </strong><br/>
   1. Agro Fert is a blend of essential elements like Fe, Mn, Zinc, Copper, Molybdenum and Boron.<br/>
2. It provides balanced nutrition through soil and foliar spray, and takes care of hidden hunger that is not easily visible in plants, which is otherwise not fully available.<br/>

3. The use of Agro Fert increases the yield as well as improves the quality of fruits.<br/>
In many cases, its use takes care of the damage caused by many pests, pests and diseases.<br/>

4. Agro Fert is recommended for use as a foliar application on cotton, chilli, grapes, oranges and other vegetables.<br/>

For drip irrigation, Agro Fert should be sprayed at the rate of 1 litre per acre in 200 litres of water.<br/><br/>

<strong>🌿 Mode of Action:</strong><br/>
Agro Fert helps in enzymatic activity, photosynthesis, and metabolic functions in plants through effective micronutrient uptake.<br/><br/>
 <strong>🌿Caution/Precautions:</strong><br/>
1. Shake well before use.<br/>
2. Do not exceed recommended dose.<br/>
3. Keep out of reach of children and animals. translate in hindi and marathi
  `,
			mr: `
        <strong>🌿 अ‍ॅग्रो फर्टचे फायदे: </strong><br/>
  1. अ‍ॅग्रो फर्ट हे लोह (Fe), मॅंगनीज (Mn), झिंक, कॉपर, मोलिब्डेनम आणि बोरॉन यांसारख्या आवश्यक घटकांचे मिश्रण आहे.<br/>
2. हे माती आणि पाने यांद्वारे संतुलित पोषण पुरवते आणि झाडांमध्ये दिसून न येणारी लपलेली भूक भागवते, जी सामान्यतः पूर्णपणे उपलब्ध होत नाही.<br/>
3. अ‍ॅग्रो फर्ट चा वापर केल्याने उत्पादनात वाढ होते आणि फळांची गुणवत्ता सुधारते.<br/>
4. अनेक वेळा याच्या वापरामुळे कीटक, रोग आणि इतर हानिकारक घटकांपासून संरक्षण मिळते.<br/>
5. अ‍ॅग्रो फर्ट चा वापर कपाशी, मिरची, द्राक्षे, संत्री आणि इतर भाज्यांवर फवारणीसाठी करावा अशी शिफारस आहे.<br/>
6. ड्रीप सिंचनासाठी, अ‍ॅग्रो फर्ट चे प्रमाण 200 लिटर पाण्यात 1 लिटर प्रति एकर प्रमाणे वापरावे.<br/><br/>
<strong>🌿 कार्यपद्धती (Mode of Action):</strong><br/>
अ‍ॅग्रो फर्ट वनस्पतींमध्ये सूक्ष्म अन्नद्रव्यांचे प्रभावी शोषण करून एन्झाइम क्रिया, प्रकाशसंश्लेषण आणि चयापचय क्रिया सुधारण्यास मदत करते.<br/><br/>
<strong>🌿 सूचना</strong><br/>
1.वापरण्यापूर्वी चांगले हलवा.<br/>
2. शिफारस केलेल्या मात्रेपेक्षा अधिक वापर करू नका.<br/>
3. लहान मुले आणि प्राण्यांच्या आवाक्याबाहेर ठेवा.<br/>

  `,
			hi: `
        <strong>🌿 एग्रो फर्ट के लाभ</strong><br/>
  1.एग्रो फर्ट आयरन (Fe), मैंगनीज (Mn), जिंक, कॉपर, मोलिब्डेनम और बोरॉन जैसे आवश्यक तत्वों का एक मिश्रण है।<br/>
2. यह मिट्टी और पत्तियों पर स्प्रे के माध्यम से संतुलित पोषण प्रदान करता है और पौधों में दिखाई न देने वाली छुपी हुई भूख की पूर्ति करता है, जो अन्यथा पूरी तरह उपलब्ध नहीं होती।<br/>
3. एग्रो फर्ट के उपयोग से उपज में वृद्धि होती है और फलों की गुणवत्ता में भी सुधार होता है।<br/>
4. कई मामलों में इसका उपयोग कीट, रोग और अन्य समस्याओं से होने वाले नुकसान को कम करता है।<br/>
5. एग्रो फर्ट का उपयोग कपास, मिर्च, अंगूर, संतरा और अन्य सब्जियों पर पत्तियों के छिड़काव के रूप में करने की सिफारिश की जाती है।<br/>
6. ड्रिप सिंचाई के लिए, एग्रो फर्ट को 200 लीटर पानी में 1 लीटर प्रति एकड़ की दर से उपयोग करें।<br/><br/>
<strong>🌿 क्रियाविधि (Mode of Action):</strong><br/>
एग्रो फर्ट पौधों में प्रभावी सूक्ष्म पोषक तत्वों के अवशोषण के माध्यम से एंजाइम गतिविधि, प्रकाश संश्लेषण और चयापचय क्रियाओं में सहायता करता है।<br/><br/>
<strong>🌿 सूचना</strong><br/>
1. उपयोग से पहले अच्छे से हिलाएं।<br/>
2. अनुशंसित मात्रा से अधिक उपयोग न करें।<br/>
3. बच्चों और जानवरों की पहुंच से दूर रखें।<br/>
  `,
		},
		ratings: {
			average: "★ ★ ★ ★ ☆",
			count: "(1,200 ratings)",
		},
	},
	{
		id: "ASRP",
		name: {
			en: "ASRP ",
			mr: "ए यस आर पी",
			hi: "ए यस आर पी",
		},
		usage:{
			en:"Silicon strengthens crops by improving resistance to pests and diseases, enhances photosynthesis, and reduces water loss. It boosts nutrient availability, improves crop shine, and extends post-harvest shelf life.",
			mr:"सिलिकॉन पीकांना कीड व रोगांपासून संरक्षण देऊन प्रतिकारशक्ती वाढवतो, हरितद्रव्य व पानांची हरियाली वाढवतो. तो पोषकद्रव्यांची उपलब्धता वाढवतो व फळांची साठवण क्षमता सुधारतो.",
			hi:"सिलिकॉन फसल को कीट और रोगों से बचाकर रोग प्रतिरोधक क्षमता बढ़ाता है, पत्तियों की हरियाली और चमक बढ़ाता है। यह पोषक तत्वों की उपलब्धता बढ़ाता है और फसल का भंडारण समय बढ़ाता है।"
		},
		price: "₹ 350",
		MRP: "₹ 370",
		image: "/product new images/asrp1.png",
		Quantity: "500 gm",
		about: {
			en: `
      <strong>🌿 Silicon Benefits:</strong><br/>
1. Silicon protects the crop from the attack of sap-sucking insects and reduces the incidence of fungal diseases, thereby increasing the resistance to disease.<br/>
2. Silicon increases the amount of chlorophyll in the leaves, which enhances the photosynthesis activity of the leaves, helping in better food storage in crops.<br/>
3. The use of silicon greatly reduces water evaporation through fronds, thus conserving water.<br/>
4. Silicon increases the availability of phosphorus, potassium, and micronutrients when applied through fertilizers from the soil.<br/>
5. The use of silicon helps reduce chemical residues on crops after spraying.<br/>
6. Silicon improves leaf greenness and fruit shine, increasing the post-harvest storage life of fruits and vegetables.<br/><br/>
<strong>🌿Dosage of Silicon:</strong><br/>

1. For spraying: Spray at the rate of 2 grams per liter of water<br/>
2. Suitable Crops: All crops (flowers, fruit trees, vegetables, etc.)<br/><br/>
<strong>⚠️ Precautions:</strong><br/>
1. Do not exceed the recommended dose.<br/>
2. Shake well before use and prepare a fresh solution.<br/>
3. Keep away from children, animals, and direct sunlight.
    `,
			mr: `
       <strong>🌿 सिलिकॉनचे फायदे:</strong><br/>
1. सिलिकॉन रस शोषणाऱ्या किडींपासून पिकांचे संरक्षण करते आणि बुरशीजन्य रोगांचे प्रमाण कमी करते, त्यामुळे रोगप्रतिकारक शक्ती वाढते.<br/>
2. सिलिकॉन मुळे पानांतील क्लोरोफिलची मात्रा वाढते, ज्यामुळे प्रकाशसंश्लेषण क्रिया वाढते आणि पिकांमध्ये अन्नसाठा चांगला होतो.<br/>
3.सिलिकॉन वापरल्याने पानांद्वारे होणारे पाण्याचे बाष्पीभवन कमी होते आणि पाण्याची बचत होते.<br/>
4. मातीमध्ये खताद्वारे दिल्यास सिलिकॉन मुळे फॉस्फरस, पोटॅश आणि सूक्ष्म अन्नद्रव्यांची उपलब्धता वाढते.<br/>
5. सिलिकॉनचा वापर केल्याने फवारणी केलेल्या रासायनिक अवशेषांचे प्रमाण कमी होते.<br/>
6. सिलिकॉन मुळे पानांची गडद हिरवळ आणि फळांची चमक वाढते, ज्यामुळे कापणीनंतर फळे व भाजीपाला जास्त दिवस टिकतो.<br/><br/>
<strong>🌿 सिलिकॉनचे प्रमाण:</strong><br/>

1. फवारणीसाठी: 2 ग्रॅम प्रति लिटर पाणी<br/>
2. योग्य पिके: सर्व पिके (फुले, फळझाडे, भाजीपाला इ.)<br/><br/>
<strong>⚠️ सावधगिरी:</strong><br/>
1. शिफारस केलेल्या मात्रेपेक्षा जास्त वापर करू नका.<br/>
2. वापरण्यापूर्वी चांगले हलवा आणि ताजे द्रावण तयार करा.<br/>
3. लहान मुले, प्राणी व थेट सूर्यप्रकाशापासून दूर ठेवा.
    `,
			hi: `
    <strong> 🌿 सिलिकॉन के फायदे:</strong><br/>
1. सिलिकॉन रस चूसने वाले कीटों के हमले से फसल को बचाता है और फंगल रोगों की घटनाओं को कम करता है, जिससे फसलों में रोग प्रतिरोधक क्षमता बढ़ती है।<br/>
2. सिलिकॉन पत्तियों में क्लोरोफिल की मात्रा बढ़ाता है, जिससे प्रकाश संश्लेषण की प्रक्रिया तीव्र होती है और फसलों में भोजन का भंडारण बेहतर होता है।<br/>
3. सिलिकॉन के प्रयोग से पत्तियों के माध्यम से जल वाष्पीकरण में भारी कमी आती है, जिससे पानी की बचत होती है।<br/>
4. मिट्टी के माध्यम से खाद के रूप में देने पर सिलिकॉन फॉस्फोरस, पोटाश और सूक्ष्म पोषक तत्वों की उपलब्धता बढ़ाता है।<br/>
5. सिलिकॉन का प्रयोग फसलों पर छिड़के गए रसायनों के अवशेष को कम करने में सहायक होता है।<br/>
6. सिलिकॉन पत्तियों की हरियाली और फलों की चमक बढ़ाता है, जिससे फलों और सब्जियों का भंडारण समय बढ़ जाता है।<br/><br/>
<strong> 🌿 सिलिकॉन की मात्रा:</strong><br/>

1. फवारनी हेतु: 2 ग्राम प्रति लीटर पानी में मिलाकर छिड़काव करें<br/>
2. अनुशंसित फसलें: सभी फसलें (फूल, फलदार पेड़, सब्जियाँ आदि)<br/><br/>
<strong>⚠️ सावधानियाँ:</strong><br/>
1. अनुशंसित मात्रा से अधिक उपयोग न करें।<br/>
2. उपयोग से पहले अच्छी तरह हिलाएं और ताजा घोल बनाएं।<br/>
3. बच्चों, जानवरों और सीधे धूप से दूर रखें।<br/>
    `,
		},
		ratings: {
			average: "★ ★ ★ ★ ☆",
			count: "(1,000 ratings)",
		},
	},
	{
		id: "Mycorhiza",
		name: {
			en: "Mycorhiza ",
			mr: "मायकोरायजा",
			hi: "मायकोरायजा",
		},
		usage:{en:"",mr:"",hi:""},
		price: "₹ 550",
		MRP: "₹ 850",
		image: "/product new images/active_micorrizha1.png",
		Quantity: "200 gm",
		about: {
			en: `
			<strong>🌿 Benefits of Mychorhia</strong><br/><br/>
  1) Better Nutrient Absorption: Mycorrhiza biofertilizer enhances nutrient uptake through a symbiotic relationship with mycorrhizal fungi.<br/>

 2) Stronger Roots: Promotes deeper, healthier root growth for improved plant stability.<br/>

3) Stress Resistance: Increases plant tolerance to drought, poor soil, and environmental stress.<br/>

4) Improves Soil Health: Boosts soil structure and microbial activity for a healthier growing environment.<br/>

5) Eco-Friendly Solution: Supports sustainable farming with an organic, chemical-free approach.<br/>

6) Boosts Yield & Quality: Increases crop yield and enhances produce quality through improved plant health.<br/>
        `,
			mr: `
			<strong>🌿 मायकोरायजाचे फायदे:</strong><br/><br/>
       1) पोषक तत्वांचे चांगले शोषण: मायकोरायझा जैवखत मायकोरायझल बुरशींसोबत सहजीवन संबंध तयार करून पोषण शोषण वाढवते.<br/>
2) मजबूत मुळे: खोलवर आणि आरोग्यदायी मुळांची वाढ करून पिकांची स्थिरता सुधारते.<br/>
3) ताण सहन करण्याची क्षमता: दुष्काळ, खराब माती व पर्यावरणीय ताण सहन करण्याची क्षमता वाढवते.<br/>
4) मातीच्या आरोग्यात सुधारणा: मातीची रचना व सूक्ष्मजैविकांची सक्रियता वाढवते, जे पिकासाठी अनुकूल वातावरण निर्माण करते.<br/>
5) पर्यावरणपूरक उपाय: सेंद्रिय व रसायनमुक्त दृष्टिकोनातून शाश्वत शेतीला प्रोत्साहन देते.<br/>
6) उत्पन्न व दर्जा वाढवतो: पिकांच्या चांगल्या आरोग्यामुळे उत्पादन व गुणवत्तेत लक्षणीय वाढ होते.<br/>
        `,
			hi: `
			<strong>🌿 मायकोरायजाचे फायदे:</strong><br/><br/>
        1) बेहतर पोषक तत्वों का अवशोषण: माइकोराइजा जैव उर्वरक माइकोराइजल फंगस के साथ सहजीवी संबंध बनाकर पोषक तत्वों का अवशोषण बढ़ाता है।<br/>
2) मजबूत जड़ें: गहरी और स्वस्थ जड़ों की वृद्धि को प्रोत्साहन देता है जिससे पौधों की स्थिरता बढ़ती है।<br/>
3) तनाव सहनशीलता: सूखा, खराब मिट्टी और पर्यावरणीय तनाव सहन करने की पौधे की क्षमता बढ़ाता है।<br/>
4) मृदा स्वास्थ्य में सुधार: मिट्टी की संरचना और सूक्ष्मजीवों की सक्रियता को बढ़ाकर बेहतर खेती के लिए उपयुक्त वातावरण बनाता है।<br/>
5) पर्यावरण अनुकूल समाधान: जैविक और रासायन मुक्त दृष्टिकोण से टिकाऊ खेती को बढ़ावा देता है।<br/>
6) उपज और गुणवत्ता में वृद्धि: पौधों के अच्छे स्वास्थ्य के कारण फसल की उपज और गुणवत्ता दोनों में सुधार होता है।<br/>
        `,
		},
		ratings: {
			average: "★ ★ ★ ★ ☆",
			count: "(1,200 ratings)",
		},
	},
	{
		id: "humi_drip",
		usage:{en:"",mr:"",hi:""},
		name: {
			en: "Humi Drip",
			mr: "ह्युमी ड्रिप",
			hi: "ह्युमी ड्रिप",
		},
		price: "₹ 430",
		MRP: "₹ 650",
		image: "/product new images/humi_drip1.png",
		Quantity: "1000 ml",
		about: {
			en: `
        <strong>🌿 Benefits of Humi Drip :</strong><br/>
1. Humi Drip helps in root development, resulting in vigorous growth of plants and trees.<br/>
2. In pomegranate plants, it enhances root growth, leading to an increase in the number of flowers and leaves.<br/>
3. While transplanting nursery plants like onion, tomato, chilli, brinjal, and flowers, dipping them in Humi Dip solution promotes quicker and healthier growth.<br/><br/>
<strong>🌿 Usage Method:</strong><br/>

1. Spray: 2 to 3 ml per litre of water<br/>
2. Through Drip Irrigation: 1 litre per acre<br/><br/>
<strong>⚠️ Precautions:</strong><br/>
Shake well before use.<br/>
Do not exceed the recommended dosage.<br/>
Keep out of reach of children and animals.<br/>
        `,
			mr: `
        <strong>🌿 हयुमी ड्रिपचे फायदे:</strong><br/>
      1. हयुमी ड्रिपच्या वापरामुळे मुळांची वाढ होऊन रोपे आणि झाडांची जोमाने वाढ होते.<br/>
2. डाळिंब झाडांच्या मुळांची वाढ होऊन फुले व पानांची संख्या वाढते.<br/>
3. नर्सरीतील रोपे, कांदा, टोमॅटो, मिरची, वांगी, फुलांची लागवड करताना हयुमी डिपच्या द्रावणात रोपे बुडविल्यास ती लवकर आणि जोमाने वाढतात.<br/><br/>
<strong>🌿 वापराची पद्धत:</strong><br/>

1. फवारणी: २ ते ३ मिली प्रति लिटर पाणी<br/>
2. ड्रिपद्वारे: १ लिटर प्रति एकर<br/><br/>
<strong>⚠️ सावधगिरी:</strong><br/>

1. वापरण्यापूर्वी चांगले हलवा.<br/>
2. शिफारसीपेक्षा अधिक मात्रा वापरू नका.<br/>
3. लहान मुले व प्राण्यांच्या आवाक्याबाहेर ठेवा.
        `,
			hi: `
        <strong>🌿 हयुमी ड्रिप के फायदे :</strong><br/>
1. हयुमी ड्रिप के उपयोग से जड़ों की वृद्धि होती है और पौधे तथा पेड़ तेजी से बढ़ते हैं।<br/>
2. अनार के पौधों की जड़ों की वृद्धि होकर फूलों और पत्तों की संख्या बढ़ती है।<br/>
3. नर्सरी के पौधे, प्याज, टमाटर, मिर्च, बैंगन, फूलों की खेती करते समय हयुमी डिप के घोल में पौधों को डुबोने से पौधे जल्दी और स्वस्थ रूप से बढ़ते हैं।<br/><br/>
<strong>🌿 उपयोग की विधि:</strong><br/>
1. फवारनी: 2 से 3 मिली प्रति लीटर पानी<br/>
2. ड्रिप द्वारा: 1 लीटर प्रति एकड़<br/><br/>
<strong>⚠️ सावधानियाँ:</strong><br/>
1. उपयोग से पहले अच्छी तरह हिलाएं।<br/>
2. अनुशंसित मात्रा से अधिक प्रयोग न करें।<br/>
3. बच्चों और पशुओं की पहुंच से दूर रखें।
        `,
		},
		ratings: {
			average: "★ ★ ★ ★ ☆",
			count: "(1,200 ratings)",
		},
	},
];
